src/Documents/ВводНачальныхОстатковЦен/ВводНачальныхОстатковЦен.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВводНачальныхОстатковЦен</name>
  <registerRecords>InformationRegister.ЦеныПредметовСнабжения</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформация</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Цены</name>
    <attributes>
      <name>UID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПредметСнабжения</name>
      <type>
        <types>CatalogRef.КаталогПредметовСнабжения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипЦены</name>
      <type>
        <types>EnumRef.ТипыЦен</types>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Организации</types>
        <types>CatalogRef.ИностранныеЗаказчики</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>8</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.ОКВ</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ОКЕИ</types>
      </type>
    </attributes>
    <attributes>
      <name>Статус</name>
      <type>
        <types>EnumRef.СтатусыКонтрактов</types>
      </type>
    </attributes>
    <attributes>
      <name>УсловиеПоставки</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/ВводНачальныхОстатковЦен/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("СсылкаПС") Тогда
		
		Найдено = Объект.Цены.НайтиСтроки(Новый Структура("ПредметСнабжения", Параметры.СсылкаПС));
		
		Если Найдено.Количество() > 0 Тогда
			
			Элементы.Цены.ТекущаяСтрока = Найдено[0].ПолучитьИдентификатор();
			
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьУсловиеПоставкиНаСервере()
	
	ДопИнформация = Объект.ДополнительнаяИнформация;
	
	Для каждого Стр Из Объект.Цены Цикл
		
		Если Стр.УсловиеПоставки = "" Тогда
			Стр.УсловиеПоставки = ДопИнформация;
		Иначе
			Если ПерезаписатьСуществующие Тогда	
				Стр.УсловиеПоставки = ДопИнформация;
			КонецЕсли; 
		КонецЕсли; 
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьУсловиеПоставки(Команда)
	
	ЗаполнитьУсловиеПоставкиНаСервере();
	
КонецПроцедуры
